Show / Hide Table of Contents
Class ApplicationBIM
Inheritance
System.Object
ApplicationBIM
Implements
IApplicationBIM
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public abstract class ApplicationBIM : IApplicationBIM
Constructors
Improve this Doc   View Source
ApplicationBIM()
Default contructor
Declaration
public ApplicationBIM()
Improve this Doc   View Source
ApplicationBIM(IPluginLogger)
Constructor for injecting the instance of a logger
Declaration
public ApplicationBIM(IPluginLogger logger)
Parameters
 Type |  Name |  Description
 IPluginLogger |  logger
The wrapper for logger
Properties
Improve this Doc   View Source
ApplicationName
Declaration
protected abstract string ApplicationName { get; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Id
Declaration
public int Id { get; }
Property Value
 Type |  Description
 System.Int32
Methods
Improve this Doc   View Source
ActivateInBIM(List<BIMItemId>)
Declaration
public abstract void ActivateInBIM(List<BIMItemId> items)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.List<BIMItemId> |  items
Improve this Doc   View Source
GetActiveSelection()
Declaration
public virtual List<BIMItemId> GetActiveSelection()
Returns
 Type |  Description
 System.Collections.Generic.List<BIMItemId>
Improve this Doc   View Source
GetActiveSelectionModel(CountryCode, RequestedItemsType)
Declaration
public ModelBIM GetActiveSelectionModel(CountryCode countryCode, RequestedItemsType requestedType)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
 RequestedItemsType |  requestedType
Returns
 Type |  Description
 ModelBIM
Improve this Doc   View Source
GetActiveSelectionModelXML(CountryCode, RequestedItemsType)
Declaration
public string GetActiveSelectionModelXML(CountryCode countryCode, RequestedItemsType requestedType)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
 RequestedItemsType |  requestedType
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetApplicationName()
Declaration
public string GetApplicationName()
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetModelForSelection(CountryCode, List<BIMItemsGroup>)
Declaration
public List<ModelBIM> GetModelForSelection(CountryCode countryCode, List<BIMItemsGroup> items)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
 System.Collections.Generic.List<BIMItemsGroup> |  items
Returns
 Type |  Description
 System.Collections.Generic.List<ModelBIM>
Improve this Doc   View Source
GetModelForSelectionXML(CountryCode, List<BIMItemsGroup>)
Declaration
public string GetModelForSelectionXML(CountryCode countryCode, List<BIMItemsGroup> items)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
 System.Collections.Generic.List<BIMItemsGroup> |  items
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
ImportActive(CountryCode, RequestedItemsType)
Declaration
protected abstract ModelBIM ImportActive(CountryCode countryCode, RequestedItemsType requestedType)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
 RequestedItemsType |  requestedType
Returns
 Type |  Description
 ModelBIM
Improve this Doc   View Source
ImportSelection(CountryCode, List<BIMItemsGroup>)
Declaration
protected abstract List<ModelBIM> ImportSelection(CountryCode countryCode, List<BIMItemsGroup> items)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
 System.Collections.Generic.List<BIMItemsGroup> |  items
Returns
 Type |  Description
 System.Collections.Generic.List<ModelBIM>
Improve this Doc   View Source
IsCAD()
Declaration
public virtual bool IsCAD()
Returns
 Type |  Description
 System.Boolean
Improve this Doc   View Source
SelectAsync(List<BIMItemId>)
Declaration
public Task SelectAsync(List<BIMItemId> items)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.List<BIMItemId> |  items
Returns
 Type |  Description
 System.Threading.Tasks.Task
Implements
 IApplicationBIM
 Improve this Doc
 View Source